app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $users   = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $users->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'gohan@gmail.com'
 LIMIT 1